/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */


"infrared"="家电";
"peripheral"="安防";
"More"="更多";
"InfraRed_RemoteControl"="家电控制";  //"红外遥控";
"Unibot_DeeAnbot"="UNIBOT-管家机器人";
"Add_SmartDevice"="添加安防外设";
"Add_InfraRed_Device"="添加家电设备";
"No_Device_Title"="暂无添加设备";
"No_Device_Detail"="设备列表空空如也";

"AKey_Patrol"="一键巡逻";
"No_Remind"="暂无提醒事件";
"No_Remind_Detail"="请点击右上角“计划制定”添加提醒事件";
"Plan_Maker"="计划制定";
"Event_Add"="添加事件";
"Event_Edit"="编辑事件";
"Event_Edit_Finish"="完成编辑";
"Event_Edit_Giveup"="是否放弃修改？";
"Event_Not_Complete"="事件选择不完整，请重新确认！";
//SmartHome
"Smart_Home"="Smart Home";
"Smart_Home_Loading"="(数据加载中，请稍后...)";
"SmartHome_NoMap_Hint" ="还未建立地图，请进入清扫模块建图。\n1.请使用单个清洁模块进行建图。\n2.建图完成后可组合起来使用。";

//Add Event
"Event"="事件";
"Start_Time"="开始时间";
"Add_Content"="添加内容";
"DeeAnbot_PathAndWay"="位置及行走方式";
"Oneshot_task"="从不";
"ReminderTask"="提醒任务";
"Specify_Time"="指定时间";
"Infrared_NoDevice"="暂无设备，快去添加吧！";

"Selected"="已选定";
"Not_Selected"="未选定";
"Specify_Start_Time"="指定开始时间";

"Conflict_Msg"="所选时间与其它事件冲突，请选择有效时间";
"GetIrIndex_Hint"="获取红外Index中，请稍等！";
"GetIrIndex_Fail"="红外Index获取失败";

//Plan
"Event_Detail"="今天%@执行";
"Air_Control"="空调遥控";
"Voice_LeftTime"="剩余时间:%ds";
"Voice_Record_Hint"="按住说话,松开结束\n录音时间最多为30秒";
"Voice_Record_LessThan1s"="说话时间太短";
"Name_Modify"="修改名称";
"Not_Specify_WorkPoint"="未选定工作点";
"Voice_Sending"="音频发送中，请稍等！";
"Voice_Sending_Request"="音频发送请求中，请稍等！";
"Voice_Request_Fail"="语音请求失败";
"Voice_Send_Fail"="语音发送失败";
"Voice_Rename_Fail"="语音重命名失败!";
"Voice_Name_Nil"="录音名字不能为空";
"Event_Fisrt"="请先选择事件";
"NamenilHint"="请输入名称";



/*
 *  工作点
 */
"WorkPoint_Reached"="已到达指定点，可使用遥控主机至最佳拍摄视角，点击“确认工作点”完成工作点设定";
"Wifi_Coverage"="Wifi覆盖诊断";
"Obstacle_Avoid"="避障区规划";
"Path_Edit"="编辑路径线";
"WorkPoint_Confirm"="确认工作点";

/*
 *  More
 */
"DeeAnbot_Map_Reset_Hint"="单独使用清洁模块可进行重置地图的设定";
"DeeAnbot_Map_Reset_Explain"="重置地图之后，所有与地图相关的设定将会被清空(包括计划制定的工作点以及巡逻及其家电控制点和智能外设点等)";

/*
 *  事件选择 时间图
 */
"Seven"="日";
"One"="一";
"Two"="二";
"Three"="三";
"Four"="四";
"Five"="五";
"Six"="六";

"Patrol_Event"="巡逻事件";
"Infrared_Event"="红外事件";
"Remind_Event"="提醒事件";





